InformationRegisters/УчетнаяПолитикаПоНалоговомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоНалоговомуУчету</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьОграничениеНаМинимальныйОбъектОСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоставлятьВычетВМесяцеОтсутствияДохода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетВОСМСДляФизическихЛицИГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетОПВиВОСМСДляГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаявленногоДоходаИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияПоДоходуСубъектаПредпринимательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОбложенияДоходовРаботников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОбложенияДоходовРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыРасчетыНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыРасчетыНалогоплательщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПорядокОбложенияДоходовРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядокОбложенияДоходовРаботников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общеустановленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйПлатеж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаПоНалоговомуУчету/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
 	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УточняемыеДанные.Организация КАК Организация,
	|	УточняемыеДанные.Период КАК Период,
	|	УточняемыеДанные.ПлательщикОППВ КАК ПлательщикОППВ,
	|	УточняемыеДанные.ПрименятьОграничениеНаМинимальныйОбъектОСМС КАК ПрименятьОграничениеНаМинимальныйОбъектОСМС,
	|	УточняемыеДанные.ПредоставлятьВычетВМесяцеОтсутствияДохода КАК ПредоставлятьВычетВМесяцеОтсутствияДохода,
	|	УточняемыеДанные.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу КАК ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу,
	|	УточняемыеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений КАК НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений,
	|	УточняемыеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ КАК ПрименятьВычетВОСМСДляФизическихЛицИГПХ,
	|	УточняемыеДанные.ПрименятьВычетОПВиВОСМСДляГПХ КАК ПрименятьВычетОПВиВОСМСДляГПХ,
	|	УточняемыеДанные.СистемаНалогообложения КАК СистемаНалогообложения,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя КАК КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника,
	|	УточняемыеДанные.СуммаЗаявленногоДоходаИП КАК СуммаЗаявленногоДоходаИП,
	|	УточняемыеДанные.СпособОтраженияПоДоходуСубъектаПредпринимательства КАК СпособОтраженияПоДоходуСубъектаПредпринимательства,
	|	УточняемыеДанные.ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|ПОМЕСТИТЬ ВТДанныеДляУточнения
	|ИЗ
	|	&Данные КАК УточняемыеДанные";
	Запрос.УстановитьПараметр("Данные", ЭтотОбъект.Выгрузить());
	Запрос.Выполнить(); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УточняемыеДанные.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ПлательщикОППВ
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ПлательщикОППВ, ЛОЖЬ)
	|	КОНЕЦ КАК ПлательщикОППВ,
	|	УточняемыеДанные.Период КАК Период,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ПрименятьОграничениеНаМинимальныйОбъектОСМС
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ПрименятьОграничениеНаМинимальныйОбъектОСМС, ЛОЖЬ)
	|	КОНЕЦ КАК ПрименятьОграничениеНаМинимальныйОбъектОСМС,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений, ЛОЖЬ)
	|	КОНЕЦ КАК НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ, ЛОЖЬ)
	|	КОНЕЦ КАК ПрименятьВычетВОСМСДляФизическихЛицИГПХ,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ПрименятьВычетОПВиВОСМСДляГПХ
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ, ЛОЖЬ)
	|	КОНЕЦ КАК ПрименятьВычетОПВиВОСМСДляГПХ,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ПредоставлятьВычетВМесяцеОтсутствияДохода
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ПредоставлятьВычетВМесяцеОтсутствияДохода, ЛОЖЬ)
	|	КОНЕЦ КАК ПредоставлятьВычетВМесяцеОтсутствияДохода,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.СистемаНалогообложения
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения, ЛОЖЬ)
	|	КОНЕЦ КАК СистемаНалогообложения,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя КАК КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника,
	|	УточняемыеДанные.СуммаЗаявленногоДоходаИП КАК СуммаЗаявленногоДоходаИП,
	|	УточняемыеДанные.СпособОтраженияПоДоходуСубъектаПредпринимательства КАК СпособОтраженияПоДоходуСубъектаПредпринимательства,
	|	ВЫБОР
	|		КОГДА УточняемыеДанные.Организация = УточняемыеДанные.Организация.ГоловнаяОрганизация
	|			ТОГДА УточняемыеДанные.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаПоНалоговомуУчету.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу, ЛОЖЬ)
	|	КОНЕЦ КАК ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу,
	|	УточняемыеДанные.ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|ИЗ
	|	ВТДанныеДляУточнения КАК УточняемыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету КАК УчетнаяПолитикаПоНалоговомуУчету
	|		ПО УточняемыеДанные.Организация.ГоловнаяОрганизация = УчетнаяПолитикаПоНалоговомуУчету.Организация
	|			И УточняемыеДанные.Период = УчетнаяПолитикаПоНалоговомуУчету.Период";
	
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Данные.Организация КАК Организация
	|ИЗ
	|	ВТДанныеДляУточнения КАК Данные
	|ГДЕ
	|	Данные.Период < &ДатаКонтроля
	|	И Данные.ПредоставлятьВычетВМесяцеОтсутствияДохода";
	Запрос.УстановитьПараметр("ДатаКонтроля", '20180101');
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		СообщениеОбОшибке = НСтр("ru = 'Установка признака ""Предоставлять разрешенный вычет в месяце отсутствия дохода"" возможна не ранее 2018 года.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Данные.Организация КАК Организация
	|ИЗ
	|	ВТДанныеДляУточнения КАК Данные
	|ГДЕ
	|	Данные.Период < &ДатаКонтроля
	|	И Данные.ПорядокОбложенияДоходовРаботников = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)";
	Запрос.УстановитьПараметр("ДатаКонтроля", '20230101');
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		СообщениеОбОшибке = НСтр("ru = 'Установка порядка обложения дохода работников единым платежом возможна не ранее 2023 года.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		
	КонецЕсли;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Данные.Организация КАК Организация,
	|	Данные.Период КАК Период
	|ИЗ
	|	ВТДанныеДляУточнения КАК Данные
	|ГДЕ
	|	НЕ Данные.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалогиВзносыРасчетыНалогоплательщиковОстатки.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков.Остатки(&Период, Организация = &Организация) КАК НалогиВзносыРасчетыНалогоплательщиковОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаПоНалоговомуУчетуСрезПоследних
		|		ПО НалогиВзносыРасчетыНалогоплательщиковОстатки.Организация = УчетнаяПолитикаПоНалоговомуУчетуСрезПоследних.Организация
		|ГДЕ
		|	УчетнаяПолитикаПоНалоговомуУчетуСрезПоследних.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу
		|	И НалогиВзносыРасчетыНалогоплательщиковОстатки.НалогВзносОстаток <> 0";
		Запрос.УстановитьПараметр("Период", Выборка.Период);
		Запрос.УстановитьПараметр("Организация", Выборка.Организация);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Снятие признака ""Отражать в НУ удержание налогов и взносов пропорционально выплаченному доходу"" не возможно.
			|В регистре ""Налоги, взносы расчеты налогоплательщиков"" по организации %1 присутствуют остатки.'"),Выборка.Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УточняемыеДанные.Организация КАК Организация,
	|	УточняемыеДанные.ПлательщикОППВ КАК ПлательщикОППВ,
	|	УточняемыеДанные.ПрименятьОграничениеНаМинимальныйОбъектОСМС КАК ПрименятьОграничениеНаМинимальныйОбъектОСМС,
	|	УточняемыеДанные.ПредоставлятьВычетВМесяцеОтсутствияДохода КАК ПредоставлятьВычетВМесяцеОтсутствияДохода,
	|	УточняемыеДанные.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу КАК ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу,
	|	УточняемыеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений КАК НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений,
	|	УточняемыеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ КАК ПрименятьВычетВОСМСДляФизическихЛицИГПХ,
	|	УточняемыеДанные.ПрименятьВычетОПВиВОСМСДляГПХ КАК ПрименятьВычетОПВиВОСМСДляГПХ,
	|	УточняемыеДанные.СистемаНалогообложения КАК СистемаНалогообложения,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя КАК КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя,
	|	УточняемыеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника,
	|	УточняемыеДанные.СуммаЗаявленногоДоходаИП КАК СуммаЗаявленногоДоходаИП,
	|	УточняемыеДанные.СпособОтраженияПоДоходуСубъектаПредпринимательства КАК СпособОтраженияПоДоходуСубъектаПредпринимательства,
	|	УточняемыеДанные.ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников,
	|	УточняемыеДанные.Период КАК Период
	|ПОМЕСТИТЬ ВТНовыеДанные
	|ИЗ
	|	&Данные КАК УточняемыеДанные
	|";
	Запрос.УстановитьПараметр("Данные", ЭтотОбъект.Выгрузить());
	Запрос.Выполнить(); 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организации.Ссылка КАК Организация,
	|	НовыеДанные.ПлательщикОППВ КАК ПлательщикОППВ,
	|	НовыеДанные.ПрименятьОграничениеНаМинимальныйОбъектОСМС КАК ПрименятьОграничениеНаМинимальныйОбъектОСМС,
	|	НовыеДанные.ПредоставлятьВычетВМесяцеОтсутствияДохода КАК ПредоставлятьВычетВМесяцеОтсутствияДохода,
	|	НовыеДанные.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу КАК ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу,
	|	НовыеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений КАК НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений,
	|	НовыеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ КАК ПрименятьВычетВОСМСДляФизическихЛицИГПХ,
	|	НовыеДанные.ПрименятьВычетОПВиВОСМСДляГПХ КАК ПрименятьВычетОПВиВОСМСДляГПХ,
	|	НовыеДанные.СистемаНалогообложения КАК СистемаНалогообложения,
	|	НовыеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя КАК КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя,
	|	НовыеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника,
	|	НовыеДанные.СуммаЗаявленногоДоходаИП КАК СуммаЗаявленногоДоходаИП,
	|	НовыеДанные.СпособОтраженияПоДоходуСубъектаПредпринимательства КАК СпособОтраженияПоДоходуСубъектаПредпринимательства,
	|	НовыеДанные.ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников,
	|	НовыеДанные.Период КАК Период
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНовыеДанные КАК НовыеДанные
	|		ПО Организации.Ссылка.ГоловнаяОрганизация = НовыеДанные.Организация
	|ГДЕ
	|	Организации.Ссылка <> Организации.ГоловнаяОрганизация
	|	И Организации.ГоловнаяОрганизация В
	|			(ВЫБРАТЬ
	|				Организации.Организация
	|			ИЗ
	|				ВТНовыеДанные КАК Организации
	|			ГДЕ
	|				Организации.Организация = Организации.Организация.ГоловнаяОрганизация)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Выборка);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
